## git과 gitHub의 차이

#### [Git]

- **로컬에서 관리하는 버전 관지 시스템 (VCS : Version Control System)**

* **소스코드 수정에 따른 버전을 관리해주는 시스템**

#### [Github]

- **클라우드 방식으로 관리되는 버전 관리 시스템 (VCS)**
- **자제 구축이 아닌 빌려쓰는 클라우드의 개념**
- **오픈소스는 일정 부분 무료로 저장이 가능하고 아닐 경우에는 유료를 사용함**

![img](https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FcqwWj3%2FbtqCckCDdUD%2FLVMvU0EOrwQhLF6owuA88k%2Fimg.png)

    Git은 로컬에서 버전 관리 시스템을 운영하는 방식이다.
    Github는 저장소를 깃허브에서 제공해주는 클라우드 서버를 이용한다는 것이 아주 큰 차이이다.

    다른 사람들과 협업할 경우에는, 오픈소스를 공유하고 다른 사람들의 의견을 듣고 싶은 경우 깃허브를 사용하여
    편리하게 기능을 사용할 수 있다. 혼자 작업하거나 폐쇄적인 범위 내에서의 협업이면 Git만 사용해도 좋다.

### VCS

#### 버전 관리 시스템이란 쉽게 말해 코드가 변경된 부분을 모두 기억한다는 의미이다.

    코드가 수정될 때마다 파일로 하나하나 따로 저장해주거나 수동으로 백업하기 어렵지만, 이러한 일을 대신 한다.

    어떤 부분이 수정이 됐는지, 수정된 부분을 이전 버전으로 롤백 하는 등의 기능들을 가지고 있습니다.
    코드 수정에 따른  위험성을 줄일 수 있기 때문에 개발자에게 가장 필요한 부분(시스템)이라고 할 수 있다.
